app/views/lesson_plans/_form.html.erb

    <%= f.label :lesson %><br />
    <%= grouped_collection_select :lesson_plan, :lesson_id, Unit.all, :lessons, :title, :id, :title %>
---
SELECT "lessons".* FROM "lessons"