app/views/lessons/_form.html.erb

SELECT "units".* FROM "units"
---
		<%= f.label :unit %>
		<%= collection_select :lesson, :unit, Unit.all, :id, :title, {:prompt => "Select a unit..."} %>