app/views/teachers/planning.html.erb

		<div id="student_search">
			<%= grouped_collection_select :lesson, :id, Unit.all, :lessons, :full_title, :id, :abbr_title, {}, {:id => "lesson_select_menu"}%>
---
SELECT "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT 1