app/controllers/lesson_plans_controller.rb

  def index
    @lesson_plans = LessonPlan.includes(:lesson).order("lessons.unit_id, lessons.number").all
---
SELECT "lesson_plans".* FROM "lesson_plans"

  def create
    @lesson_plan = LessonPlan.new(lesson_plan_params)

    respond_to do |format|
      if @lesson_plan.save
---
INSERT INTO "lesson_plans" ("content", "created_at", "updated_at") VALUES (?, ?, ?)

  def update
    respond_to do |format|
      if @lesson_plan.update(lesson_plan_params)
---
UPDATE "lesson_plans" SET "content" = ?, "updated_at" = ? WHERE "lesson_plans"."id" = 1

    def set_resource
      @lesson_plan = LessonPlan.includes(:lesson).find(params[:id])
---
SELECT "lesson_plans".* FROM "lesson_plans" WHERE "lesson_plans"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" IN (1)