app/controllers/lessons_controller.rb

  def create
    @lesson = Lesson.new(lesson_params)
    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "content" = ?, "updated_at" = ? WHERE "lessons"."id" = 1