app/controllers/students_controller.rb

SELECT "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT 1
---
  def workbook
    @student = Student.find(params[:id])
  	if is_student_or_teacher_for(params[:id], @student)
  	  @lesson = Lesson.first(:include => :unit)