app/controllers/students_controller.rb

SELECT "units".* FROM "units" WHERE "units"."id" IN (1)
---
  def workbook
    @student = Student.find(params[:student_id])
  	if is_student_or_teacher_for(params[:student_id], @student)

      if params[:lesson_id]
        @lesson = Lesson.find(params[:lesson_id], :include => :unit)