app/controllers/teachers_controller.rb

  def planning
    @lesson = Lesson.find(params[:lesson_id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" IN (1)

  def in_class
  	@lesson = Lesson.first(:include => :unit)
---
SELECT "lessons".* FROM "lessons" ORDER BY "lessons"."id" ASC LIMIT 1