app/controllers/units_controller.rb

  def create
    @unit = Unit.new(unit_params)

    respond_to do |format|
      if @unit.save
---
INSERT INTO "units" ("created_at", "number", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 21 Apr 2013 19:56:38 UTC +00:00], ["number", 1], ["title", "What is Language?"], ["updated_at", Sun, 21 Apr 2013 19:56:38 UTC +00:00]]

    def set_unit
      @unit = Unit.find(params[:id])
---
SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]